app/models/shortened_url.rb

  def self.random_code
    url = SecureRandom::urlsafe_base64
    url = SecureRandom::urlsafe_base64 while ShortenedUrl.exists?(short_url: url)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "8lgPC0oOtn1te1y7qQCSGg"], ["LIMIT", 1]]

  def self.generate_shortened_url(user_obj, long_url)
    ShortenedUrl.create!({long_url: long_url, user_id: user_obj.id})
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "https://startpage.com"], ["short_url", "8lgPC0oOtn1te1y7qQCSGg"], ["user_id", 1], ["created_at", "2019-04-08 23:32:53.984455"], ["updated_at", "2019-04-08 23:32:53.984455"]]