app/models/visit.rb

INSERT INTO "visits" ("user_id", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["short_url", "https://g.com"], ["created_at", "2019-04-08 23:31:55.229537"], ["updated_at", "2019-04-08 23:31:55.229537"]]
---
  def self.record_visit!(user, shortened_url)
    Visit.create!({user_id: user.id, short_url: shortened_url.short_url})